laiwengen/M2C_UDP_E1-N2/M2C_UDP_E1-N2/Src/frameworks/esp8266_new.c
#include "string.h"
#include "stdio.h"
#include "stdlib.h"
#include "frameworks/strings.h"
#include "frameworks/tick.h"
#include "frameworks/wireless.h"
#include "frameworks/esp8266.h"
#include "frameworks/number.h"
#include "stm32f0xx_hal.h"



void esp8266_connect(wireless_socket_t* socket);
void esp8266_disconnect(wireless_socket_t* socket);
//void esp8266_send(wireless_socket_t* socket, char* data);
uint8_t esp8266_send(uint8_t type, char const* host, uint16_t port, uint8_t* buffer, uint16_t size);
static void esp8266_startup4D(void** params);
void esp8266_sendHttp(wireless_socket_t socket, esp8266_httpRequest_t* request);
static uint8_t esp8266Package4D(uint8_t* buffer, int16_t size, void** params);
esp8266_t* g_esp8266_main;
#define ESP8266_SEND_TOP_SCHEDULE_ID 0x3485

// uint32_t* g_esp8266_listenerIdGenerator = 0;

#define ESP8266_STATUS_CHECKER_SCHEDULE_ID 0x54cc8266
#define ESP8266_LISTERNER_SCHEDULE_ID 0xc8888266
#define ESP8266_STARTUP_SCHEDULE_ID 0xdb358266

//uint8_t esp8266_packageListener(uint8_t* buffer, uint16_t size, void* params) {
//	return 0;
//}

//uint8_t esp8266_smartLinkListener(uint8_t* buffer, uint16_t size, void* params) {
//	return 0;
//}

//uint8_t esp8266_statusListener(uint8_t* buffer, uint16_t size, void* params) {
//	return 0;
//}
void esp8266_stream4D(stream_t* stream, stream_listener_t* listener, uint8_t* buffer, int16_t size) {
	esp8266_t* esp8266 = g_esp8266_main;
	list_t* list = esp8266->listeners;
	while (list) {
		if (list->this.raw) {
			esp8266_listener_t* listener = (esp8266_listener_t*) list->this.raw;
			if (listener->function(buffer, size, listener->params)) {
				break;
			}
		}
		list = list->next;
	}
}
stream_listener_t g_esp8266_lineListener = {
	STREAM_LISTENER_TYPE_endByte,
	esp8266_stream4D,
	{.endWith = '\n'},
	{0}
};
stream_listener_t g_esp8266_tickListener = {
	STREAM_LISTENER_TYPE_tick,
	esp8266_stream4D,
	{.ticks = 100},
	{0}
};
void doSend(uint8_t* buffer, int16_t size) {
	esp8266_t* esp_8266 = g_esp8266_main; 
	stream_write(esp_8266->outStream, (const uint8_t*)buffer, size);
	stream_flush(esp_8266->outStream);
}
static void deleteCommand(int16_t index) {
	esp8266_t* esp8266 = g_esp8266_main;
	esp8266_command_t* c = (esp8266_command_t*)list_removeByIndex(&esp8266->commands, index);
	if (c) {
		free(c->bytes);
		free(c);
	}
}

static uint8_t paramMatch(const char* str, int16_t index, const char* toMatch) {
	char** out;
	int16_t size = string_split(str, ',', &out);
	uint8_t match = 0;
	if (size > index) {
		char* t = string_trim(out[index]);
		if (t) {
			if (string_equal(t, toMatch)) {
				match = 1;
			}
			free(t);
		}
	}
	for (int16_t i = 0; i < size; i++) {
		free(out[i]);
	}
	free(out);
	return match;
}
static int16_t parseDecs(const char* str, char splitter, int32_t** outDec) {
	char** out;
	int16_t size = string_split(str, splitter, &out);
	*outDec = 0;
	if (size) {
		int32_t* buffer = (int32_t*) malloc(size*sizeof(int32_t));
		if (buffer) {
			*outDec = buffer;
			int8_t dp;
			for (int16_t i = 0; i < size; i++) {
				char* t = string_trim(out[i]);
				if (t) {
					number_fromDecString(t, strlen(t), &buffer[i], &dp);
					free(t);
				}
			}
		}
	}
	for (int16_t i = 0; i < size; i++) {
		free(out[i]);
	}
	free(out);
	return size;
}
esp8266_status_t esp8266_getStatus(void)
{
	return (g_esp8266_main->status);
}
uint8_t esp8266_setStatus(esp8266_status_t status)
{
	if (g_esp8266_main->status != status) {
	
		g_esp8266_main->status = status;
		return 1;
	}
	return 0;
}
void esp8266_reset(void** params)
{
	esp8266_t* esp8266 = g_esp8266_main;
	
	if (esp8266->status != ESP8266_STATUS_smarting)
	{
		schedule_cancel(ESP8266_STATUS_CHECKER_SCHEDULE_ID);
		schedule_cancel(ESP8266_RESET_SCHEDULE_ID);
		schedule_cancel(ESP8266_SEND_TOP_SCHEDULE_ID);
		schedule_cancel(ESP8266_STARTUP_SCHEDULE_ID);
		schedule_cancel(MAIN_ESP8266_AUTO_RESET_SCHEDULE_ID);
		esp8266_setStatus(ESP8266_STATUS_starting);
		
		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 60000, 0);
		schedule_once(ESP8266_STARTUP_SCHEDULE_ID, esp8266_startup4D, 1000, 0);
	//	schedule_once(ESP8266_STARTUP_SCHEDULE_ID, esp8266_startup4D, 1500, 0);
	//	schedule_once(esp8266_RESET_SCHEDULE_ID, esp8266_reset,30000,0);
		while (list_size(&esp8266->commands) > 0) {
			deleteCommand(0);
		}
		while (list_size(&esp8266->sockets) > 0) {
			wireless_socket_t* socket = list_removeFirst(&esp8266->sockets);
			if (socket) {
				free(socket->host);
				free(socket);
			}
		}
		esp8266_hw_reset();
		
	}
}
//void esp8266_reset(void)
//{
//	schedule_once(ESP8266_RESET_SCHEDULE_ID,esp8266_reset,0,0);
//}
enum esp8266_socket_type_t {
	ESP8266_SOCKET_TCP,
	ESP8266_SOCKET_UDP
};

uint8_t esp8266_common4R(uint8_t* buffer, int16_t size) {
	static int8_t errorCount = 0;
	if (string_startWith((const char*)buffer, "OK")) {
		errorCount = 0;
		return 1;
	} else if (string_startWith((char*)buffer, "ERROR")) {
		if (errorCount > 8) {
			errorCount = 0;
			schedule_once(ESP8266_RESET_SCHEDULE_ID,esp8266_reset,0,0);
		} else {
			errorCount ++;
		}
		return 2;
	}
	return 0;
}
uint8_t esp8266_presend4R(void** bytes, void** params) {
	// sim800_t* sim800 = g_sim800_main;
	uint8_t* buffer = *(uint8_t**)bytes[0];
	int16_t size = *(int16_t*)bytes[1];
	if (string_startWith((const char*)buffer, "> ") && size == 2) {
		return 1;
	}
	
	//busy s...
	uint8_t done = esp8266_common4R(buffer, size);
	if (done == 2) {
		deleteCommand(1);
		return done;
	}
	else 
	{
		return 0;
	}
 
}
void esp8266_resetLineListener(void** params)
{
	g_esp8266_lineListener.type = STREAM_LISTENER_TYPE_endByte;
}
uint8_t esp8266_postsend4R(void** bytes, void** params) {
	// esp8266_t* esp8266 = g_esp8266_main;
	uint8_t* buffer = *(uint8_t**)bytes[0];
	int16_t size = *(int16_t*)bytes[1];
	char* line = string_duplicate((char const*)buffer, size);
	if (line) {
		uint8_t match = string_startWith(line, "SEND OK");
//		uint8_t match = string_startWith(line, "Recv ");
		free(line);
		if (match) {
			g_esp8266_lineListener.type = STREAM_LISTENER_TYPE_ignore;
			schedule_once(0,esp8266_resetLineListener,5000,0);
			//esp8266Package4D(buffer, size, 0);
			//continue to other 4D
			return 1;
		}
//		uint8_t match = string_startWith(line, "bus");
//		free(line);
//		if (match) {
//			return 1;
//		}		
	}
	return esp8266_common4R(buffer, size);
}

