laiwengen/M2C_UDP_E1-N2/M2C_UDP_E1-N2/Src/frameworks/esp8266_new.c
//20180627 TODO TEST status4R
static uint8_t esp8266Status4R(void** bytes, void** params) {
//	 esp8266_t* esp8266 = g_esp8266_main;
	//+CIPSTATUS:1,"UDP","47.95.28.196",59732,42300,0
	uint8_t* buffer = *(uint8_t**)bytes[0];
	int16_t size = *(int16_t*)bytes[1];
	esp8266_status_t lastStatus = esp8266_getStatus();
	char* line = string_duplicate((char const*)buffer, size);
	if (line) {
		if (string_startWith((const char*)buffer, "STATUS:"))
		{
			int32_t* decs;
			int16_t decCount;
			decCount = parseDecs((const char*)buffer,':',&decs);
			if (decCount > 0) {
				int32_t status = decs[1];
				if (lastStatus != ESP8266_STATUS_smarting)
				{
					if (lastStatus != ESP8266_STATUS_ok)
					{
						if (status == 2)
						{
							esp8266_setStatus(ESP8266_STATUS_getIP);	
							
							schedule_reset(ESP8266_RESET_SCHEDULE_ID,30000);
						}
						else if (status == 3)
						{
							esp8266_setStatus(ESP8266_STATUS_connectWifi);	
						}
					}
					if (status == 4 || status == 5)
					{
						esp8266_setStatus(ESP8266_STATUS_connectWifi);	
						schedule_once(ESP8266_RESET_SCHEDULE_ID,esp8266_reset,30000,0);	
					}
//					if (lastStatus == ESP8266_STATUS_getIP || lastStatus == ESP8266_STATUS_connectWifi)
//					{//+CIPSTATUS:0,"UDP","47.95.28.196",59732,3925,0
//						
//						esp8266_setStatus(ESP8266_STATUS_connectWifi);
//					}
					
				}
				free(decs);
			}
		}
//		else if (string_startWith((const char*)buffer, "+CIPSTATUS:"))
//		{
//			
//		}
		free(line);
	}
	return esp8266_common4R(buffer, size);
}	
//#define ESP8266_SEND_TOP_SCHEDULE_ID 0xf4d3348a
static void sendTop(void** params) { // params is not used
	esp8266_t* esp8266 = g_esp8266_main;
	if (list_size(&esp8266->commands) > 0) {
		esp8266_command_t* c = (esp8266_command_t*)list_peekFirst(&esp8266->commands);
		if (c->retries > 0) {
			c->retries--;
			doSend(c->bytes, c->size);
			if (c->function == esp8266_postsend4R) { // TODO
				if (esp8266->sendingFunction) {
					esp8266->sendingFunction(esp8266,c->params, c->bytes, c->size);
				}
			}
			schedule_once(ESP8266_SEND_TOP_SCHEDULE_ID, sendTop, c->timeout, params);
		} else {
			//drop it
			deleteCommand(0);
			sendTop(params);
		}
	}
}
uint8_t esp8266_connected4R(void** bytes, void** params) {
//	 esp8266_t* esp8266 = g_esp8266_main;
	uint8_t* buffer = *(uint8_t**)bytes[0];
	int16_t size = *(int16_t*)bytes[1];
	wireless_socket_t* socket = (wireless_socket_t*)params;
	if (socket) {
		char* line = string_duplicate((char const*)buffer, size);
		if (line) {
			uint8_t match = paramMatch(line, 1, "CONNECT") || string_startWith((const char*)buffer, "ALREADY CONNECT");
			free(line);
			if (match) {
				socket->connected = 1;
//				if (esp8266->smartLinkFunction)
//				{
//					esp8266->smartLinkFunction(esp8266);
//				}
				return 1;
			}
		}
//		if (socket->type == ESP8266_SOCKET_UDP) {
//			if (string_startWith((const char*)buffer, "OK")) {
//				socket->connected = 1;
//				return 1;
//			}
//		}
	}
	return esp8266_common4R(buffer, size);
}
//static void sendCommand(sim800_command_t* c) {
//	sim800_t* sim800 = g_sim800_main;
//	list_t* cl = (list_t*)list_peekLast(&sim800->commands);
//	list_add(&sim800->commands, c);
//	if (list_size(&sim800->commands) == 1) {
//		sendTop(0);
//	}
//}
void esp8266_commandOut(esp8266_command_t* c) {
	esp8266_t* esp8266 = g_esp8266_main;
	list_t* cl = (list_t*)list_peekLast(&esp8266->commands);
	list_add(&esp8266->commands, c);
	if (list_size(&esp8266->commands) == 1) {
		sendTop(0);
	}
}

void esp8266_command(const char* cmd, uint16_t timeout, uint16_t retries, esp8266_comandFunction_t function, void* params) {
	esp8266_command_t* c = (esp8266_command_t*)malloc(sizeof(esp8266_command_t));
	if (c) {
		c->bytes = (uint8_t*)string_duplicate(cmd, -1);
		c->size = strlen(cmd);
		c->timeout = timeout;
		c->retries = retries;
		c->function = function;
		c->params = params;
		esp8266_commandOut(c);
	}
}


uint8_t esp8266_send(uint8_t type, char const* host, uint16_t port, uint8_t* buffer, uint16_t size) {
	esp8266_t* esp8266 = g_esp8266_main;
		if (esp8266->status < ESP8266_STATUS_getIP) {
		return 0;
	}
	if (list_size(&esp8266->commands) > 10) {
		return 0;
	}
	int8_t socketCount = list_size(&esp8266->sockets);
	wireless_socket_t* socket = 0;
	char idBuffer[2];
	// find if socket alread exists
	list_t* l = esp8266->sockets;
	while (l) {
		if (l->this.raw) {
			wireless_socket_t* s = (wireless_socket_t*) l->this.raw;
			if (s->type == type && string_equal(host, s->host) && port == s->port) {
				socket = s;
				break;
			}
		}
		l = l->next;
	}
	// start a new one if not exists
	uint8_t needDisconnect = 0;
	if (socket == 0) {
		// start a new one if not exists
		if (socketCount < 6) {
			socket = (wireless_socket_t*) malloc(sizeof(wireless_socket_t));
			if (socket) {
				socket->id = socketCount;
			}
		} else {
			socket = list_removeFirst(&esp8266->sockets);
			if (socket) {
				if (socket->connected) {
					needDisconnect = 1;
				}
				free(socket->host);
			}
		}
		if (socket) {
			socket->connected = 0;
		}
	}
	// init id string
	if (socket) {
		number_toDecString(socket->id, 0, idBuffer, sizeof(idBuffer));
	}
	// fill id buffer for future use
	if (socket) {
		if (needDisconnect) {
			char const* concats[] = {"AT+CIPCLOSE=", idBuffer, "\r\n"};
			char* str = string_concat(concats, sizeof(concats) / sizeof(char*));
			if (str) {
				esp8266_command(str, 200, 2, 0, 0);
				free(str);
			}
		}
	}
	//TODO add setuped for UDP?
	// check if connected
	// even if udp do not need the CONNECT. but this just make sure it has sent the CIPSTART for host and port.
	if (socket && socket->connected == 0 && esp8266->wifiSsid ) {
		list_add(&esp8266->sockets, socket);
		socket->type = type;
		socket->host = string_duplicate(host, -1);
		socket->port = port;
		char portBuffer[6];
		number_toDecString(port, 0, portBuffer, sizeof(portBuffer));
		char const* concats[] = {"AT+CIPSTART=",idBuffer,",\"",type==ESP8266_SOCKET_TCP?"TCP":"UDP","\",\"",host,"\",",portBuffer,"\r\n"};
		char* str = string_concat(concats,sizeof(concats)/sizeof(char*));
		if (str) {
			schedule_reset(ESP8266_STATUS_CHECKER_SCHEDULE_ID,4000);
			esp8266_command(str, 2000, 1, esp8266_connected4R, (void**)socket);
			free(str);
		}
	}
	// send data
	if (socket && esp8266->wifiSsid && socket->connected) {
		char lengthBuffer[6];
		number_toDecString(size, 0, lengthBuffer, sizeof(lengthBuffer));
		char const* concats[] = {"AT+CIPSEND=", idBuffer, ",", lengthBuffer, "\r\n"};
		char* str = string_concat(concats, sizeof(concats) / sizeof(char*));
		if (str) {
			// sim800_command("AT+CGATT?\n",2000,5,0,0); //
			esp8266_command(str, 200, 1, esp8266_presend4R, (void**)socket);
			free(str);
			esp8266_command_t* c = (esp8266_command_t*)malloc(sizeof(esp8266_command_t));
			uint8_t* bytes = (uint8_t*)malloc(size);
			if (c && bytes) {
				memcpy(bytes, buffer, size);
				c->bytes = bytes;
				c->size = size;
				c->timeout = 200;
				c->retries = 1;
				c->function = esp8266_postsend4R;
				c->params = socket;
				esp8266_commandOut(c);
			} else {
				free(c);
				free(bytes);
			}
		}
	}
	return 0;
}
//static uint8_t incStatus(uint8_t status, uint8_t to) {
//	return max(status, to);
//}

