laiwengen/M2C_UDP_E1-N2/M2C_UDP_E1-N2/Src/frameworks/esp8266_new.c
//static uint8_t decStatus(uint8_t status, uint8_t to) {
//	return min(status, to);
//}

uint8_t esp8266_ready(void)
{
	esp8266_t* esp8266 = g_esp8266_main;
	if (esp8266->status >= ESP8266_STATUS_getIP)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}
static uint8_t esp8266Info4R(void** bytes, void** params) {
		esp8266_t* esp8266 = g_esp8266_main;
		uint8_t* buffer = *(uint8_t**)bytes[0];
		int16_t size = *(int16_t*)bytes[1];
		if ((uint32_t)params == 0 ) {
			if (size <256) {
				//+ CWJAP_CUR:"ssid",<bssid>
				if (string_startWith((const char*)buffer, "No AP"))
				{
					esp8266_setStatus(ESP8266_STATUS_connectWifi);
				}
				else if (string_startWith((const char*)buffer,"+CWJAP_CUR:"))
				{
					int16_t length = strlen("+CWJAP_CUR:");
					char* ssidBuffer = string_duplicate((const char*)(buffer + length),size-length);
					if (ssidBuffer)
					{	
						char** ssid = NULL;
						int16_t splitSize = string_split((const char*)ssidBuffer,',',&ssid);
						if (splitSize>1)
						{
							int16_t ssidLength = strlen(ssid[0]) - 2;
							if (esp8266->wifiSsid) {
								free(esp8266->wifiSsid);
								esp8266->wifiSsid = NULL;
							}
							char* tssid = malloc(ssidLength + 1);
							*(ssid[0]+ssidLength+1) = '\0';
							if (tssid) {
								strcpy(tssid,ssid[0]+1);
								esp8266->wifiSsid = tssid;//del  double quotes
								if (esp8266->ipChangedFunction) {
									esp8266->ipChangedFunction(esp8266);
								}					
							}

							
							//return 1;
						}
							for (int16_t i = 0; i < splitSize; i++) {
							free(ssid[i]);
						}
						free(ssid);
						free(ssidBuffer);
					}
				}
			}
		}
		// 867793034663403
		// schedule_cancel(MAIN_esp8266_INFO_SCHEDULE_ID);
		return esp8266_common4R(buffer, size);
}
static uint8_t esp8266Status4D(uint8_t* buffer, int16_t size, void** params) {
	esp8266_t* esp8266 = g_esp8266_main;
	esp8266_status_t esp8266Status = esp8266->status;
	uint8_t match = 0;
	if (string_startWith((char const*)buffer, "AT+")) {
		char* line = string_duplicate((char const*)buffer, size);
		if (line) {
			char** out;
			int16_t splitSize = string_split(line, '+', &out);
			if (size>1) {
				char* command = string_trim(out[1]);
				//char* status = string_trim(out[1]);
				if (command) {
//					if (string_startWith((char const*)command, "CWSTARTSMART")) {
////						int32_t* decs;
////						int16_t decCount = parseDecs(code, ',', &decs);
//						esp8266Status = ESP8266_STATUS_smarting;
//					
//					}
//					else 
					if (string_equal((char const*)command, "CWSTOPSMART")) {
						schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 30000, 0);
						esp8266Status = ESP8266_STATUS_initOK;
					
					}
				}
				free(command);

			}
			for (int16_t i = 0; i < splitSize; i++) {
				free(out[i]);
			}
			free(out);
			free(line);
		}
	}
	else if (string_startWith((char const*)buffer, "WIFI CONNECTED"))
	{
//		esp8266Status = ESP8266_STATUS_connectWifi;
		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 60000, 0);
	}
	else if (string_startWith((char const*)buffer, "Smart get wifi info"))	
	{
			if (esp8266->smartLinkFunction) {
				esp8266->smartLinkFunction(esp8266);
			}		
	}
	else if (string_startWith((char const*)buffer, "WIFI GOT IP"))
	{
		esp8266Status = ESP8266_STATUS_getIP;
		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 30000, 0);
		esp8266_command("AT+CWJAP_CUR?\r\n",2000,2,esp8266Info4R,0);
//		esp8266_command("AT+CWJAP_CUR?\r\n",2000,2,esp8266Info4R,0);
	}
	else if (string_startWith((char const*)buffer, "WIFI DISCONNECT") && esp8266Status != ESP8266_STATUS_smarting)
	{
		esp8266Status = ESP8266_STATUS_connectWifi;
		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 30000, 0);
	}
	else if (string_startWith((char const*)buffer, "READY") && esp8266Status < ESP8266_STATUS_initOK)
	{
		esp8266Status = ESP8266_STATUS_initOK;
		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 30000, 0);
	}
	else if (string_startWith((char const*)buffer, "DHCP TIMEOUT") )
	{
		if (esp8266Status == ESP8266_STATUS_smarting)
		{
			esp8266_smartStop();
			esp8266Status = ESP8266_STATUS_connectWifi;
		}
		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 30000, 0);
	}
	else if (string_startWith((char const*)buffer, "DNS Fail") )
	{
	//	esp8266Status = ESP8266_STATUS_initOK;
		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 30000, 0);
	}
//	else if (string_startWith((char const*)buffer, "smartconfig connected wifi") || )
//	{

//	}
	if (esp8266_setStatus(esp8266Status)) {
		schedule_reset(ESP8266_STATUS_CHECKER_SCHEDULE_ID, 0);
	}
//	if (setStatus(status)) {
//		schedule_reset(esp8266_STATUS_CHECKER_SCHEDULE_ID, 0);
//	}
	// "+CPIN: READY" -> SIM card
	// "+CSQ: 0,0" -> signal strength
	// "+CREG: 0,1" ->  web status
	// "+CGATT: 1" -> gprs
	return match;
}


	
void esp8266_sendBytes(uint8_t* buffer,uint16_t size)
{
	//char* str="test\r\n";
	  stream_write(g_esp8266_main->outStream,buffer,size);//将字符串str写入dma的发送buffer里,注意如果发送字节流不可用strlen
    stream_flush(g_esp8266_main->outStream);//调用定义的flushFunction函数
}
char const * const g_esp8266_statusCheckCommands[] = {
	"AT+CIPSTATUS\r\n",
};
void esp8266_statusChecker(void** params) {
	static uint32_t index;
	static int16_t pdt = 0;
	esp8266_t* esp8266 = g_esp8266_main;
	if (!esp8266_hw_isPowerOn()) {
		if (pdt > 2) {
			pdt = 0;
			esp8266_reset(0);
		} else {
			pdt ++;
		}
		return;
	} else {
		pdt = 0;
	}
	if (list_size(&esp8266->commands) > 10) {
		return;
	}
	uint8_t status = esp8266->status;
	
//	if (status >= ESP8266_STATUS_getIP && !(esp8266->wifiSsid)) {
////			esp8266_comandFunction_t function = 0;
//////			function = esp8266_status4R;
////			esp8266_command(g_esp8266_statusCheckCommands[0], 200, 1, function, 0); //
//		esp8266_command("AT+CWJAP_CUR?\r\n",2000,2,esp8266Info4R,0);
//	}
	if ((status != ESP8266_STATUS_smarting) && ((index & 0x0f) == 0)) {
		esp8266_command("AT+CIPSTATUS\r\n",2000,2,esp8266Status4R,0);
	}

	if (status != ESP8266_STATUS_ok) {
		if (!schedule_exists(ESP8266_RESET_SCHEDULE_ID)) {
			schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset,60000,0);
		}
	} else {
		schedule_cancel(ESP8266_RESET_SCHEDULE_ID);
	}
	index++;
	uint32_t now = tick_ms();
	if ((status == ESP8266_STATUS_smarting) && ((esp8266->smartNoApTick) - now > (UINT32_MAX>>1)) )
	{
		esp8266_smartStop();
		//esp8266_setStatus(ESP8266_STATUS_initOK);
		esp8266_reset(0);
	}	
	
