laiwengen/M2C_UDP_E1-N2/M2C_UDP_E1-N2/Src/frameworks/esp8266_new.c
}
void esp8266_delayStatusChecker(void** params){
	if (schedule_exists(ESP8266_STATUS_CHECKER_SCHEDULE_ID)) {
		schedule_reset(ESP8266_STATUS_CHECKER_SCHEDULE_ID,5000);
	}
}
void esp8266_comandInit(void** params) {

	esp8266_sendBytes("+++",3);
	esp8266_command("AT+CIPMODE=0\r\n",2000,5,0,0);
	esp8266_command("AT+CIPMUX=1\r\n",2000,5,0,0);
	esp8266_command("AT+CWMODE_DEF=1\r\n",2000,5,0,0); // 1: client,2: host, 3: both
	esp8266_command("AT+CWAUTOCONN=1\r\n",2000,5,0,0); //
	esp8266_command("AT+SAVETRANSLINK=0\r\n",2000,5,0,0);
	
	schedule_repeat(ESP8266_STATUS_CHECKER_SCHEDULE_ID, esp8266_statusChecker, 1000, 0);
}

static void onCommandReceived(void** params) {
	schedule_cancel(ESP8266_SEND_TOP_SCHEDULE_ID);
	// esp8266_t* esp8266 = g_esp8266_main;
	uint8_t error = (uint32_t) params;
	if (!error) {
		deleteCommand(0);
	}
	sendTop(0);
}
static uint8_t esp8266Command4D(uint8_t* buffer, int16_t size, void** params) {
	esp8266_t* esp8266 = g_esp8266_main;
	uint8_t done = 0;
	esp8266_command_t* c = (esp8266_command_t*)list_peekFirst(&esp8266->commands);
	if (c) {
		if (c->function) {
			void* ps[] = {&buffer, &size};
			done = c->function(ps, c->params);
		} else {
			done = esp8266_common4R(buffer,size);
		}
	}
	if (done) {
		schedule_once(ESP8266_SEND_TOP_SCHEDULE_ID, onCommandReceived, 100, (void**)((done & 2) != 0));
		return 1;
	}
	return 0;
}

uint8_t esp8266_connected4D(uint8_t* buffer, int16_t size, void** params) {
	return 0;
}
//static void resetListenerType(void ** params) {
//	schedule_cancel(ESP8266_LISTERNER_SCHEDULE_ID);
//	g_esp8266_lineListener.type = STREAM_LISTENER_TYPE_endByte;
//}
static uint8_t esp8266Package4D(uint8_t* buffer, int16_t size, void** params) {
	//"+IPD,id,length:data" to do 
//#error "not complete"
	esp8266_t* esp8266 = g_esp8266_main;
	uint32_t id = 0;
	int16_t length = 0;
	int16_t headLength = 0;
	__IO int16_t validSize = size;
	
	uint8_t match = 0;
//	if (packStarted && receivedPackLength > 0 && receivedPackLength < length)
//	{
//		memc
//	}
//	else 
	char* startAddr = 0;
	startAddr = strstr((char const*)buffer, "+IPD");
	if (startAddr != NULL) {
		//validSize -= 2;
		char* line = string_duplicate((char const*)(startAddr), validSize);
		if (line) {
			
			char** out = NULL;
			volatile int16_t splitSize = string_split(line, ':', &out);
			free(line);
			if (splitSize>1)
			{
				headLength = strlen(out[0]) + 1;
				int32_t* decs;
				int16_t decCount = parseDecs(out[0], ',', &decs);
				
				if (decCount > 2) {
					id = decs[1];
					length = decs[2];
				}
				free(decs);
				for (int16_t i = 0; i < splitSize; i++) {
					free(out[i]);
				}
				free(out);
				
				uint8_t* bufferToDeal = NULL;
				bufferToDeal = (uint8_t*)(buffer + 2 + headLength);
				
				if (length + headLength <=validSize ) {
					wireless_socket_t* socket = (wireless_socket_t*)list_findById(&esp8266->sockets, id);
					if (esp8266->receivedFunction) {
						esp8266->receivedFunction(esp8266, socket, bufferToDeal, length);
					}
					//resetListenerType(0);
					
					match = 1;
				}
				else
				{
					match = 0;
				}
			}
		}
		esp8266_resetLineListener(0);
		return match;
	}
	return 0;
}

esp8266_listener_t* esp8266_addListener(esp8266_listenerFunction_t function, void* params) {
	esp8266_listener_t* listener = (esp8266_listener_t*)malloc(sizeof(esp8266_listener_t));
	if (listener) {
		// listener->id = g_esp8266_listenerIdGenerator++;
		listener->function = function;
		listener->params = params;
		if (!list_addLast(&g_esp8266_main->listeners,listener)){
			free (listener);
			return 0;
		}
	}
	return listener;
}

uint8_t esp8266_removeListenerFunction(void* ptr, void* params) {
	esp8266_listener_t* listener = (esp8266_listener_t*) ptr;
	esp8266_listener_t* paramListener = *((esp8266_listener_t**) params);
	return listener == paramListener;
}
void esp8266_removeListener(esp8266_listener_t* listener) {
	esp8266_t* esp8266 = g_esp8266_main;
	esp8266_listener_t* removed = list_remove(&esp8266->listeners, listener);
	free(removed);
}
//void esp8266_removeListener(esp8266_t* console, esp8266_listener_t* listener) {
//	void* ptr = list_removeIf(esp8266_removeListenerFunction, &listener);
//	free(ptr);
//}

static void esp8266_startup4D(void** params)
{
	if (esp8266_hw_isPowerOn())
	{
		schedule_cancel(ESP8266_STARTUP_SCHEDULE_ID);
		schedule_once(ESP8266_STARTUP_SCHEDULE_ID, esp8266_comandInit, 500, 0);
		
	}
	else
	{
		schedule_once(ESP8266_STARTUP_SCHEDULE_ID, esp8266_startup4D, 500, 0);
	}

}
static uint8_t esp8266Smart4R(void** bytes, void**params) {
	esp8266_t* esp8266 = g_esp8266_main;
		uint8_t* buffer = *(uint8_t**)bytes[0];
	int16_t size = *(int16_t*)bytes[1];
	esp8266_status_t esp8266Status = esp8266->status;
	uint8_t err = 0;
	uint8_t match = 0;
	err = esp8266_common4R(buffer, size);
	if (err < 3) {

		esp8266Status = ESP8266_STATUS_smarting;
		match = 1;		
	}
	else if (err == 3)
	{
		//match = 0;
		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 0, 0);
	}
	
	esp8266_setStatus(esp8266Status);
//	else if (string_equal((char const*)command, "CWSTOPSMART")) {

//		schedule_once(ESP8266_RESET_SCHEDULE_ID, esp8266_reset, 30000, 0);
//		esp8266Status = ESP8266_STATUS_initOK;
//	}
	return match;

}
void esp8266_smartStop(void)
{
	esp8266_command("AT+CWSTOPSMART\r\n",1000,2,0,0);
}
void esp8266_smart(uint32_t lastingMs)
{
	//esp8266_t* esp8266 = g_esp8266_main;
	g_esp8266_main->smartNoApTick = tick_ms() + lastingMs;
//	esp8266_command("AT+CIPCLOSE=0\r\n",1000,2,0,0);
//	esp8266->sockets->
	esp8266_command("AT+CWSTARTSMART=3\r\n",2000,3,esp8266Smart4R,0); 
}

void esp8266_init(esp8266_t* esp8266) {
	g_esp8266_main = esp8266;
	esp8266_hw_init();
	
	stream_add(esp8266->inStream);
	stream_add(esp8266->outStream);
	stream_addListener(esp8266->inStream, &g_esp8266_lineListener);
	stream_addListener(esp8266->inStream, &g_esp8266_tickListener);

	esp8266_addListener(esp8266Status4D, 0);
	esp8266_addListener(esp8266Command4D, 0);
	esp8266_addListener(esp8266Package4D, 0);
//	esp8266_addListener(esp8266_connected4D, 0);
//	esp8266_addListener(esp8266Status4D, 0);
	esp8266_reset(0);
}
void esp8266_deinit(esp8266_t* esp8266) {
	
//	esp8266_reset(0);
//	stream_removeListener
	g_esp8266_main = NULL;
	esp8266_hw_powerOff(0);
	
}
